# YOLOv12 Swin-T backbone configuration
# Requires timm: `pip install timm`
# Example command:
#   yolo detect train model=ultralytics/cfg/models/v12/yolov12_swin_t.yaml \
#     data=path/to/tomato.yaml epochs=100 imgsz=640 project=tomato-run name=swin_t
# Ensure the dataset YAML declares `nc: 1` and `names: ["tomato"]` for a single-class tomato task.

nc: 1  # number of classes (tomato)

backbone:
  # [from, repeats, module, args]
  - [-1, 1, SwinT, []]          # 0: produces [P3, P4, P5]
  - [0, 1, Index, [0]]          # 1: P3 stride 8
  - [0, 1, Index, [1]]          # 2: P4 stride 16
  - [0, 1, Index, [2]]          # 3: P5 stride 32

head:
  - [3, 1, A2C2f, [768, True, 1]]        # 4: refine P5
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]             # concat P4
  - [-1, 1, A2C2f, [512, False, -1]]      # 7: P4 head
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]]             # concat P3
  - [-1, 1, A2C2f, [256, False, -1]]      # 10: P3 head
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]             # merge with P4 head
  - [-1, 1, A2C2f, [512, False, -1]]      # 13: refined P4
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 4], 1, Concat, [1]]             # merge with P5 head
  - [-1, 1, C3k2, [768, True]]            # 16: final P5
  - [[10, 13, 16], 1, Detect, [nc]]       # Detect(P3, P4, P5)
